Repository: 5uso/WorldTranslationExtractor
Catalog: language/*/LC_MESSAGES/*.po
Languages: es, zh_cn

source: Scanning dimension '{}'...
es: Escaneando dimensión '{}'...
zh_cn: 正在扫描维度“{}”……

source: Extracting from world:
es: Extrayendo del mundo:
zh_cn: 从存档提取：

source: Extracting from structures...
es: Extrayendo desde estructuras...
zh_cn: 正在从结构中提取……

source: Extracting from data files...
es: Extrayendo desde archivos de datos...
zh_cn: 正在从数据文件中提取……

source: Extracting from text files...
es: Extrayendo desde archivos de texto...
zh_cn: 正在从文本文件中提取……

source: Outputting lang to '{}'...
es: Escribiendo lang a '{}'...
zh_cn: 正在输出语言文件到“{}”……

source: Done!
es: Hecho!
zh_cn: 完成！

source: Extractors not found {}
es: Extractores no encontrados {}
zh_cn: 未找到提取器 {}

source: Extractors incompatible with data version {}
es: Extractores incompatibles con versión de datos {}
zh_cn: 提取器与数据版本 {} 不兼容

source: Could not write to file '{}'
es: No se pudo escribir al archivo '{}'
zh_cn: 无法写入文件“{}”

source: A tool to extract translatable text from Minecraft worlds to facilitate localization.
es: Una herramienta para extraer textos traducibles de mundos de Minecraft para permitir localizarlos.
zh_cn: 一个从MC存档中提取可翻译文本以便于本地化的工具。

source: Path to the target world.
es: Ruta al mundo a extraer.
zh_cn: 目标存档的路径。

source: Path to output a translated copy of the world. By default, outputs to <WORLD>_wte.
es: Ruta en la que crear una copia traducida del mundo. Por defecto, <WORLD>_wte.
zh_cn: 输出翻译文件的路径，默认路径为 <WORLD>_wte。

source: Delete previous contents of <OUT> before extracting.
es: Borrar los anteriores contenidos de <OUT> antes de empezar.
zh_cn: 在提取前删除 <OUT> 中的现有内容。

source: Path to output translation json. By default, outputs to wte_lang.json.
es: Ruta en la que escribir el json de traducción. Por defecto, wte_lang.json.
zh_cn: 指定输出翻译 JSON 文件的路径，默认为 wte_lang.json。

source: An extractor to run over the world, multiple may be selected. If no extractors are specified, all available extractors will be run.
es: Un extractor que ejecutar sobre el mundo, se pueden seleccionar varios. Si no se especifican extractores, se ejecutarán todos los disponibles.
zh_cn: 指定要运行的提取器，可以指定多个。不指定时将运行所有可用的提取器。

source: A dimension to scan, multiple may be selected. If no dimensions are specified, all dimensions will be scanned.
es: Una dimensión para escanear, se pueden seleccionar varias. Si no se especifican dimensiones, se escanearán todas.
zh_cn: 指定要扫描的维度，可以选择多个。若不指定，则扫描所有维度。

source: Keep duplicate translation texts as separate keys.
es: Mantener textos duplicados bajo distintas keys de traducción.
zh_cn: 保留重复的翻译文本作为单独的键。

source: Sort output json alphabetically.
es: Ordenar los contenidos del json de salida alfabéticamente.
zh_cn: 按字母顺序排序输出 JSON。

source: Amount of spaces used to indent the output json.
es: Cantidad de espacios con la que se indenta el json de salida.
zh_cn: 输出 JSON 的缩进空格数。

source: When iterating the world, save every <BATCH> chunks.
es: Mientras se itera el mundo, guardar cada <BATCH> chunks.
zh_cn: 遍历存档时，每处理 <BATCH> 个区块保存一次。

source: Ignore extractor data version incompatibilities.
es: Ignorar incompatibilidades de versión de datos en los extractores.
zh_cn: 忽略提取器与数据版本的兼容性问题。

source: Creating working copy of the world...
es: Creando una copia en la que trabajar sobre el mundo...
zh_cn: 正在创建存档备份……

source: Could not copy world: {}. Exiting...
es: No se pudo copiar el mundo: {}. Saliendo...
zh_cn: 无法复制世界：{}。 正在退出……

source: Could not load requested world: {}. Exiting...
es: No se pudo cargar el mundo seleccionado: {}. Saliendo...
zh_cn: 无法加载请求的世界：{}。 正在退出……

source: Invalid settings: {} Exiting...
es: Ajustes inválidos: {} Saliendo...
zh_cn: 设置无效：{} 正在退出……

source: Extraction interrupted. Output file partially translated. Exiting...
es: Extracción interrumpida. El archivo de salida puede estar parcialmente traducido. Saliendo...
zh_cn: 提取被中断。输出文件部分翻译完成。 正在退出……

source: Error loading chunk: {} This error may indicate the version of amulet you're using is not compatible with your Minecraft version. Exiting...
es: Error cargando chunk: {} Este error puede indicar que la versión de amulet que estás usando no es compatible con tu versión de Minecraft. Saliendo...
zh_cn: 加载区块时出错：{} 此错误可能表明您使用的 Amulet 版本与 Minecraft 版本不兼容。 正在退出……

source: Error accessing tag: {} This error may indicate the current extractors are not compatible with your Minecraft version. Exiting...
es: Error accediendo a la tag: {} Este error puede indicar que los extractores empleados no son compatibles con tu versión de Minecraft. Saliendo...
zh_cn: 访问标签时出错：{} 此错误可能表明当前的提取器与 Minecraft 版本不兼容。 正在退出……
